{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Acne",
    "1": "Alopecia",
    "2": "Eczema",
    "3": "Fungal Infection (Nail or ringworm)",
    "4": "Herpes",
    "5": "Normal Skin",
    "6": "Psoriasis",
    "7": "Rosacea",
    "8": "Viral Infection (Chicken-pox or shingles)",
    "9": "Vitiligo",
    "10": "Warts"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acne": 0,
    "Alopecia": 1,
    "Eczema": 2,
    "Fungal Infection (Nail or ringworm)": 3,
    "Herpes": 4,
    "Normal Skin": 5,
    "Psoriasis": 6,
    "Rosacea": 7,
    "Viral Infection (Chicken-pox or shingles)": 8,
    "Vitiligo": 9,
    "Warts": 10
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0"
}
